/**
 * Тип лексемы
 */
public enum TokenType {
    /**
     * Пробелы
     */
    SPACES,

    /**
     * Переменная
     */
    VAR,

    /**
     * Целое число
     */
    NUMBER,
    /**
     * Символ '+'
     */
    ADD,
    /**
     * Символ '-'
     */
    SUB,
    /**
     * Символ '*'
     */
    MUL,
    /**
     * Символ '/'
     */
    DIV,
    /**
     * Символ '('
     */
    LPAR,
    /**
     * Символ ')'
     */
    RPAR,

    /**
    * Символ '='
    */
    EQAL,

    /**
     * 'print'
     */
    PRINT,

    /**
     * Символ ';'
     * от англ. semicolon
     */
    SEM

}
